[
  {
    "image": "https://cdn-icons-png.freepik.com/512/5222/5222787.png",
    "title": "CookBook+",
    "companyName": "KitchenTech",
    "id": 1,
    "description": "CookBook+ is your smart kitchen assistant that turns everyday cooking into a delightful adventure. Discover thousands of chef-approved recipes for every mood and occasion. The app automatically creates grocery lists, plans your weekly meals, and even adjusts serving sizes. With hands-free guided cooking and voice-controlled steps, you can focus on flavor while the app handles timing and technique. Whether you’re a beginner learning the basics or a seasoned cook looking for inspiration, CookBook+ ensures every meal is a masterpiece waiting to be shared.",
    "size": 40,
    "reviews": 11000,
    "ratingAvg": 4.4,
    "downloads": 600000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 5300 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/9068/9068750.png",
    "title": "FitTrack Pro",
    "companyName": "Healthify Labs",
    "id": 2,
    "description": "FitTrack Pro redefines fitness by turning every step, meal, and workout into a measurable success story. Whether you’re training for a marathon or simply trying to stay active, the app tracks your calories, heart rate, sleep, and steps with stunning precision. Its AI coach gives you daily personalized advice to help you achieve your fitness goals faster. Sync with smartwatches, analyze your progress visually, and celebrate milestones that truly matter. FitTrack Pro isn’t just a fitness tracker — it’s your personal trainer, motivator, and health partner in one powerful app.",
    "size": 75,
    "reviews": 24500,
    "ratingAvg": 4.6,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2400 },
      { "name": "4 star", "count": 5200 },
      { "name": "5 star", "count": 15100 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/1046/1046751.png",
    "title": "NoteHive",
    "companyName": "StudySmart",
    "id": 3,
    "description": "NoteHive is the ultimate digital notebook built for creative minds and busy students. Capture thoughts, class notes, and to-do lists effortlessly with beautiful organization tools and cloud sync across all devices. Its smart handwriting recognition transforms scribbles into searchable text, while reminder notifications keep your priorities on track. You can even color-code topics, record voice notes, and collaborate with friends in real-time. Whether you’re preparing for exams or brainstorming your next big idea, NoteHive helps you store, find, and refine every spark of inspiration in one seamless space.",
    "size": 32,
    "reviews": 8900,
    "ratingAvg": 4.3,
    "downloads": 400000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 4300 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/2920/2920221.png",
    "title": "TravelMate",
    "companyName": "WanderTech",
    "id": 4,
    "description": "TravelMate is your ultimate companion for every journey, from spontaneous road trips to exotic getaways. The app searches through thousands of travel sites to find you the best deals on flights, hotels, and experiences. It helps you design your itinerary, manage bookings, and discover hidden gems around your destination. With built-in travel tips, currency converters, and offline maps, you’ll always feel confident wherever you go. Travel smarter, lighter, and happier — with TravelMate guiding your every step toward unforgettable adventures and stories worth sharing.",
    "size": 68,
    "reviews": 15700,
    "ratingAvg": 4.5,
    "downloads": 850000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1700 },
      { "name": "4 star", "count": 3900 },
      { "name": "5 star", "count": 8600 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/3488/3488857.png",
    "title": "PhotoFix",
    "companyName": "PixelForge",
    "id": 5,
    "description": "PhotoFix turns every snapshot into a work of art with one tap. Using advanced AI, it automatically enhances lighting, sharpness, and color balance while preserving natural tones. Blur messy backgrounds, fix red eyes, or completely transform your photos with creative filters designed by professionals. Whether you’re editing selfies, portraits, or scenic shots, PhotoFix gives you studio-quality results in seconds. Perfect for social media creators, photographers, or anyone who wants their photos to shine — your creativity deserves nothing less than flawless perfection.",
    "size": 55,
    "reviews": 33000,
    "ratingAvg": 4.7,
    "downloads": 2200000,
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2800 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 21000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/983/983941.png",
    "title": "MindEase",
    "companyName": "ZenHealth",
    "id": 6,
    "description": "MindEase helps you find calm in chaos. It blends guided meditations, breathing exercises, and mindfulness tools to ease your stress and improve focus. Each session is crafted by mental health experts and designed to fit your mood — whether you’re seeking relaxation, better sleep, or emotional balance. The built-in progress tracker helps you stay consistent, while personalized suggestions grow with your habits. Take a few minutes daily to breathe, reflect, and restore your inner peace — because your mind deserves as much care as your body.",
    "size": 45,
    "reviews": 15800,
    "ratingAvg": 4.6,
    "downloads": 750000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1900 },
      { "name": "4 star", "count": 3400 },
      { "name": "5 star", "count": 9100 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/5726/5726926.png",
    "title": "TaskFlow",
    "companyName": "Productive Inc.",
    "id": 7,
    "description": "TaskFlow transforms your daily chaos into organized clarity. From small errands to complex projects, it keeps everything neatly structured in one place. Its sleek interface allows you to set goals, break them into tasks, and track your progress visually. Smart analytics reveal how you spend your time, helping you work smarter, not harder. You can even collaborate with teammates or family members effortlessly. TaskFlow isn’t just a to-do app — it’s a personal productivity coach designed to help you stay focused, efficient, and unstoppable every day.",
    "size": 28,
    "reviews": 9200,
    "ratingAvg": 4.2,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 2700 },
      { "name": "5 star", "count": 3500 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/3075/3075977.png",
    "title": "EduLearn+",
    "companyName": "SkillForge",
    "id": 8,
    "description": "EduLearn+ brings the world’s best learning experiences straight to your fingertips. Explore thousands of expert-led courses in technology, design, business, and more — all tailored to your skill level. Each course features interactive lessons, quizzes, and certification paths so you can track your growth as you learn. Join discussions, challenge yourself, and earn recognized badges to showcase your achievements. Whether you’re a student or a lifelong learner, EduLearn+ transforms your screen time into skill time — helping you grow smarter every single day.",
    "size": 85,
    "reviews": 21100,
    "ratingAvg": 4.5,
    "downloads": 1250000,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 2800 },
      { "name": "4 star", "count": 5400 },
      { "name": "5 star", "count": 8900 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/8149/8149986.png",
    "title": "MusicBeats",
    "companyName": "TuneCore",
    "id": 9,
    "description": "MusicBeats is your ultimate music universe where every beat tells a story. Stream millions of songs, explore trending artists, and create playlists that match your vibe. The app learns your taste and curates daily mixes that feel handcrafted just for you. Discover global hits, hidden indie gems, and share your favorite tracks with friends. Whether you’re studying, driving, or working out, MusicBeats keeps your world alive with rhythm. Enjoy high-quality audio, offline playback, and endless music discovery in one elegant app.",
    "size": 95,
    "reviews": 46000,
    "ratingAvg": 4.8,
    "downloads": 3500000,
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 4800 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 28700 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/3313/3313835.png",
    "title": "DailyBudget",
    "companyName": "FinMate",
    "id": 10,
    "description": "DailyBudget helps you take control of your finances and build better money habits effortlessly. Set a spending limit, track your daily expenses, and watch how small savings add up over time. The app visualizes your income and spending trends with clean charts that make budgeting simple and even fun. It offers personalized tips to cut costs and achieve your goals faster — whether it’s saving for a trip, paying off debt, or growing an emergency fund. DailyBudget is your pocket-sized financial planner that keeps you confident and financially aware every day.",
    "size": 33,
    "reviews": 7800,
    "ratingAvg": 4.1,
    "downloads": 420000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 2300 },
      { "name": "5 star", "count": 2200 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/8058/8058637.png",
    "title": "GameVault",
    "companyName": "PlayVerse",
    "id": 11,
    "description": "GameVault is a comprehensive gaming platform that brings the best of cloud gaming to your fingertips. It allows gamers to access their favorite titles instantly without heavy downloads, join multiplayer lobbies to play with friends, and receive personalized recommendations based on gaming preferences and activity. With intuitive controls, social features, and regular updates, GameVault ensures a seamless gaming experience for casual players and enthusiasts alike, helping you discover new games and enjoy competitive play anytime, anywhere.",
    "size": 120,
    "reviews": 67000,
    "ratingAvg": 4.7,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 2500 },
      { "name": "2 star", "count": 2800 },
      { "name": "3 star", "count": 5400 },
      { "name": "4 star", "count": 11200 },
      { "name": "5 star", "count": 45100 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/5240/5240828.png",
    "title": "ShopEase",
    "companyName": "EcomNext",
    "id": 12,
    "description": "ShopEase is your ultimate online shopping companion, offering access to millions of products across categories with ease and convenience. It provides fast delivery services, exclusive discounts for members, and curated recommendations to simplify your shopping experience. The platform integrates secure payment options, detailed product information, and user reviews, ensuring informed purchasing decisions. ShopEase aims to make online shopping seamless, enjoyable, and personalized, whether you’re looking for everyday essentials or unique finds, giving shoppers the confidence to explore and discover products at their own pace.",
    "size": 88,
    "reviews": 58000,
    "ratingAvg": 4.6,
    "downloads": 4200000,
    "ratings": [
      { "name": "1 star", "count": 1900 },
      { "name": "2 star", "count": 2400 },
      { "name": "3 star", "count": 5100 },
      { "name": "4 star", "count": 9800 },
      { "name": "5 star", "count": 38800 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/7712/7712410.png",
    "title": "NewsHub",
    "companyName": "InfoPulse",
    "id": 13,
    "description": "NewsHub delivers the latest headlines and in-depth coverage from trusted sources in one intuitive platform. It offers personalized notifications, offline reading, and a streamlined interface to keep you informed on the topics that matter most. With a focus on reliability, accuracy, and speed, NewsHub allows users to customize their news feed, explore trending stories, and access breaking news alerts in real-time. Whether you are a casual reader or a dedicated news follower, NewsHub ensures you stay updated, engaged, and well-informed anytime, anywhere.",
    "size": 26,
    "reviews": 12000,
    "ratingAvg": 4.3,
    "downloads": 650000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 3100 },
      { "name": "5 star", "count": 5900 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/2584/2584672.png",
    "title": "WeatherNow",
    "companyName": "SkyPredict",
    "id": 14,
    "description": "WeatherNow provides accurate, real-time weather forecasts to help you plan your day with confidence. The app offers live radar updates, storm alerts, and detailed forecasts including temperature, precipitation, wind speed, and humidity. Its simple, user-friendly interface allows quick access to information for any location worldwide. With customizable notifications and interactive visuals, WeatherNow keeps users informed of weather changes, helping them stay safe and prepared. Perfect for commuters, travelers, and weather enthusiasts, it combines precision with ease of use for a seamless meteorological experience.",
    "size": 29,
    "reviews": 8100,
    "ratingAvg": 4.2,
    "downloads": 470000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 3400 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/2038/2038854.png",
    "title": "ChatConnect",
    "companyName": "ComHub",
    "id": 15,
    "description": "ChatConnect is a secure messaging platform designed for seamless communication. It supports text messages, voice calls, and video calls with end-to-end encryption, ensuring privacy and safety for all users. The app includes group chats, multimedia sharing, and interactive features to keep conversations lively and organized. ChatConnect focuses on reliability, speed, and user experience, making it ideal for personal, professional, or community use. It combines modern communication tools with robust security, offering a trusted environment where people can connect, collaborate, and stay in touch effortlessly.",
    "size": 70,
    "reviews": 30000,
    "ratingAvg": 4.5,
    "downloads": 1800000,
    "ratings": [
      { "name": "1 star", "count": 1100 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 6800 },
      { "name": "5 star", "count": 17600 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/5842/5842167.png",
    "title": "DocuScan",
    "companyName": "ScanTech",
    "id": 16,
    "description": "DocuScan is a powerful document management app that transforms physical documents into editable, searchable PDFs. Using advanced AI recognition, it accurately scans, edits, and converts documents, making them easy to store, share, and access. The app supports multi-page scanning, automatic cropping, text recognition, and export to various formats. Ideal for students, professionals, and businesses, DocuScan helps streamline workflows, reduce paper clutter, and increase productivity by digitizing important paperwork efficiently. With a simple and intuitive interface, managing documents has never been faster or more convenient.",
    "size": 37,
    "reviews": 11200,
    "ratingAvg": 4.4,
    "downloads": 630000,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 3100 },
      { "name": "5 star", "count": 4900 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/5981/5981489.png",
    "title": "LearnLang",
    "companyName": "LinguaPlus",
    "id": 17,
    "description": "LearnLang is an interactive language learning app designed to help users acquire new languages efficiently. It offers quick lessons, voice practice, quizzes, and real-life conversation exercises that cater to different skill levels. With personalized learning paths and progress tracking, users can stay motivated and measure improvement over time. The app also features cultural notes and practical vocabulary for effective communication. LearnLang combines technology with pedagogy to make language learning fun, accessible, and effective for students, travelers, and professionals seeking to expand their linguistic abilities.",
    "size": 62,
    "reviews": 15800,
    "ratingAvg": 4.6,
    "downloads": 950000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 3900 },
      { "name": "5 star", "count": 8000 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/4315/4315475.png",
    "title": "FitMeal",
    "companyName": "HealthEats",
    "id": 18,
    "description": "FitMeal is a personalized nutrition app that helps users create diet plans, track calories, and discover healthy recipes. It provides customized meal suggestions based on individual goals, dietary restrictions, and activity levels. With an intuitive interface, progress tracking, and motivational insights, FitMeal makes managing your diet simple and sustainable. Users can log meals, monitor nutrients, and explore new recipes, promoting a balanced lifestyle. Ideal for fitness enthusiasts, health-conscious individuals, or anyone looking to improve eating habits, FitMeal combines technology with nutritional guidance to support better health outcomes.",
    "size": 53,
    "reviews": 9700,
    "ratingAvg": 4.3,
    "downloads": 550000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 4400 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/2438/2438078.png",
    "title": "PetCare+",
    "companyName": "PawBuddy",
    "id": 19,
    "description": "PetCare+ is a comprehensive app for managing your pet’s health and daily care. It tracks vaccination schedules, feeding times, vet appointments, and medication reminders, ensuring your pets stay healthy and happy. The app also provides tips for pet care, behavior insights, and emergency contacts. With easy-to-use tracking and notifications, PetCare+ helps pet owners organize routines, monitor health trends, and maintain records efficiently. Perfect for both new and experienced pet parents, it combines practicality with guidance to support responsible and loving pet ownership.",
    "size": 48,
    "reviews": 8800,
    "ratingAvg": 4.5,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 2900 },
      { "name": "5 star", "count": 4300 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/9010/9010932.png",
    "title": "DriveSafe",
    "companyName": "AutoSense",
    "id": 20,
    "description": "DriveSafe is an innovative app that promotes safe driving by monitoring driving behavior and providing real-time alerts. It detects signs of drowsiness, speed irregularities, and potential hazards, offering actionable insights to prevent accidents. The app integrates AI-driven analytics to track driving performance, provide tips for improvement, and ensure a safer experience on the road. With intuitive dashboards, personalized alerts, and historical data analysis, DriveSafe is perfect for individual drivers and fleet management, helping reduce risks and enhance road safety through technology-driven awareness.",
    "size": 64,
    "reviews": 7600,
    "ratingAvg": 4.4,
    "downloads": 480000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 2400 },
      { "name": "5 star", "count": 2300 }
    ]
  }
]
